{
    "sampler_config": [
        {
            "model_name": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
            "model_type": "llama",
            "prompts": ["My name is","My name is"],
            "prefill_seq_len": 32,
            "ctx_len": 64,
            "generation_len": 20,
            "full_batch_size": 2,
            "spec_length": 1,
            "is_vlm": false,
            "additional_params": {
                "max_position_embeddings": 128,
                "num_hidden_layers": 1,
                "num_attention_heads": 2,
                "hidden_size": 64,
                "intermediate_size": 256,
                "vocab_size": 32000,
                "num_key_value_heads": 1
            },
            "full_layers_output":{
                "golden_texts": {
                    "w_sampler": null,
                    "wo_sampler": null
                },
                "golden_ids": {
                    "w_sampler": null,
                    "wo_sampler": null
                }
            },
            "few_layers_output":{
                "golden_texts": {
                    "w_sampler": null,
                    "wo_sampler": null
                },
                "golden_ids": {
                    "w_sampler": null,
                    "wo_sampler": null
                }
            },
            "dummy_layers_output":{
                "golden_texts": {
                    "w_sampler": "строиochastic bed particles pintfalseFrontounter RA official Linux thee Kat tienensimp Query garbagejsfiddle� deleting",
                    "wo_sampler": null
                },
                "golden_ids": {
                    "w_sampler": null,
                    "wo_sampler": null
                }
            }
        },
        {
            "model_name": "OpenGVLab/InternVL2_5-1B",
            "model_type": "llava",
            "image_urls": [
                "https://picsum.photos/id/237/536/354",
                "https://picsum.photos/id/237/536/354"
            ],
            "prompts": [
                "Can you describe the image in detail.",
                "Can you describe the image in detail."
            ],
            "prefill_seq_len": 128,
            "ctx_len": 4096,
            "generation_len": 20,
            "full_batch_size": 2,
            "spec_length": null,
            "is_vlm": true,
            "additional_params": {
                "force_image_size": 448,
                "llm_config": {
                    "_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct",
                    "architectures": [
                        "Qwen2ForCausalLM"
                    ],
                    "hidden_size": 896,
                    "intermediate_size": 4864,
                    "max_position_embeddings": 32768,
                    "max_window_layers": 21,
                    "num_attention_heads": 14,
                    "num_hidden_layers": 1,
                    "num_key_value_heads": 2,
                    "torch_dtype": "bfloat16",
                    "use_bfloat16": true,
                    "vocab_size": 151674
                },
                "vision_config": {
                    "architectures": [
                        "InternVisionModel"
                    ],
                    "hidden_size": 1024,
                    "image_size": 448,
                    "intermediate_size": 4096,
                    "num_attention_heads": 16,
                    "num_channels": 3,
                    "num_hidden_layers": 1,
                    "norm_type": "layer_norm",
                    "qk_normalization": false,
                    "qkv_bias": true,
                    "torch_dtype": "bfloat16",
                    "use_bfloat16": true,
                    "patch_size": 14
                }
            },
            "full_layers_output":{
                "golden_texts": {
                    "w_sampler": null,
                    "wo_sampler": null
                },
                "golden_ids": {
                    "w_sampler": null,
                    "wo_sampler": null
                }
            },
            "few_layers_output":{
                "golden_texts": {
                    "w_sampler": null,
                    "wo_sampler": null
                },
                "golden_ids": {
                    "w_sampler": null,
                    "wo_sampler": null
                }
            },
            "dummy_layers_output":{
                "golden_texts": {
                    "w_sampler": null,
                    "wo_sampler": null
                },
                "golden_ids": {
                    "w_sampler": null,
                    "wo_sampler": null
                }
            }
        }
    ]
}