{
  "sampler_config": [
    {
      "model_name": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
      "model_type": "llama",
      "prompts": [
        "My name is",
        "My name is"
      ],
      "prefill_seq_len": 32,
      "ctx_len": 64,
      "generation_len": 20,
      "full_batch_size": 2,
      "spec_length": 1,
      "is_vlm": false,
      "additional_params": {
        "max_position_embeddings": 64,
        "num_hidden_layers": 1,
        "num_attention_heads": 2,
        "hidden_size": 64,
        "intermediate_size": 128,
        "vocab_size": 32000,
        "num_key_value_heads": 1
      },
      "full_layers_output": {
        "golden_texts": {
          "w_sampler": null,
          "wo_sampler": null
        },
        "golden_ids": {
          "w_sampler": null,
          "wo_sampler": null
        }
      },
      "few_layers_output": {
        "golden_texts": {
          "w_sampler": null,
          "wo_sampler": null
        },
        "golden_ids": {
          "w_sampler": null,
          "wo_sampler": null
        }
      },
      "dummy_layers_output": {
        "golden_texts": {
          "w_sampler": "\u0441\u0442\u0440\u043e\u0438ochastic bed particles pintfalseFrontounter RA official Linux thee Kat tienensimp Query garbagejsfiddle\ufffd deleting",
          "wo_sampler": null
        },
        "golden_ids": {
          "w_sampler": null,
          "wo_sampler": null
        }
      },
      "coverage_key": "sampler:causal",
      "tiers": [
        "pr",
        "exhaustive"
      ]
    },
    {
      "model_name": "OpenGVLab/InternVL2_5-1B",
      "model_type": "llava",
      "image_urls": [
        "https://picsum.photos/id/237/536/354",
        "https://picsum.photos/id/237/536/354"
      ],
      "prompts": [
        "Can you describe the image in detail.",
        "Can you describe the image in detail."
      ],
      "prefill_seq_len": 32,
      "ctx_len": 64,
      "generation_len": 20,
      "full_batch_size": 2,
      "spec_length": null,
      "is_vlm": true,
      "additional_params": {
        "force_image_size": 224,
        "dtype": "float32",
        "llm_config": {
          "_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct",
          "architectures": [
            "Qwen2ForCausalLM"
          ],
          "layer_types": [
            "full_attention"
          ],
          "hidden_size": 64,
          "intermediate_size": 128,
          "max_position_embeddings": 64,
          "max_window_layers": 2,
          "num_attention_heads": 2,
          "num_hidden_layers": 1,
          "num_key_value_heads": 2,
          "dtype": "float32",
          "use_bfloat16": false,
          "vocab_size": 151674
        },
        "vision_config": {
          "architectures": [
            "InternVisionModel"
          ],
          "hidden_size": 64,
          "image_size": 224,
          "intermediate_size": 128,
          "num_attention_heads": 16,
          "num_channels": 3,
          "num_hidden_layers": 1,
          "norm_type": "layer_norm",
          "qk_normalization": false,
          "qkv_bias": true,
          "dtype": "float32",
          "use_bfloat16": false,
          "patch_size": 14
        }
      },
      "full_layers_output": {
        "golden_texts": {
          "w_sampler": null,
          "wo_sampler": null
        },
        "golden_ids": {
          "w_sampler": null,
          "wo_sampler": null
        }
      },
      "few_layers_output": {
        "golden_texts": {
          "w_sampler": null,
          "wo_sampler": null
        },
        "golden_ids": {
          "w_sampler": null,
          "wo_sampler": null
        }
      },
      "dummy_layers_output": {
        "golden_texts": {
          "w_sampler": null,
          "wo_sampler": null
        },
        "golden_ids": {
          "w_sampler": null,
          "wo_sampler": null
        }
      },
      "coverage_key": "sampler:vlm",
      "tiers": [
        "pr",
        "exhaustive"
      ]
    }
  ],
  "spd_config": [
    {
      "id": "CB llama",
      "draft_model_name": "JackFram/llama-160m",
      "target_model_name": "JackFram/llama-160m",
      "prompts": [
        "My name is"
      ],
      "num_speculative_tokens": 2,
      "prefill_seq_len": 16,
      "ctx_len": 64,
      "prefill_bsz": 1,
      "full_batch_size": 1,
      "max_ngram_size": 3,
      "additional_params": {
        "max_position_embeddings": 64,
        "num_hidden_layers": 1,
        "num_attention_heads": 2,
        "num_key_value_heads": 2,
        "hidden_size": 64,
        "intermediate_size": 128
      },
      "coverage_key": "spd",
      "tiers": [
        "pr",
        "exhaustive"
      ]
    },
    {
      "id": "CB qwen",
      "draft_model_name": "Qwen/Qwen2-0.5B",
      "target_model_name": "Qwen/Qwen2-0.5B",
      "prompts": [
        "My name is"
      ],
      "num_speculative_tokens": 2,
      "prefill_seq_len": 16,
      "ctx_len": 64,
      "prefill_bsz": 1,
      "full_batch_size": 1,
      "additional_params": {
        "max_position_embeddings": 64,
        "num_hidden_layers": 1,
        "num_attention_heads": 2,
        "hidden_size": 64,
        "intermediate_size": 128,
        "num_key_value_heads": 1
      },
      "coverage_key": "spd",
      "tiers": [
        "exhaustive"
      ]
    }
  ]
}
